import 'package:bank_el_ziker/3_data/models/morning_or_night_zikr.dart';
import 'package:bank_el_ziker/3_data/models/zikr.dart';

import '../../../3_data/models/prayer.dart';

class InitialData {
  static List<Zikr> generalAzkar = [
    Zikr(
        id: 1,
        content: "سبحان الله",
        description:
            "قال رَسُولَ اللَّهِ ﷺ: ( أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَومٍ أَلْفَ حَسَنَةٍ؟ فَسَأَلَهُ سَائِلٌ مِن جُلَسَائِهِ: كيفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قالَ: يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ، فيُكْتَبُ له أَلْفُ حَسَنَةٍ، أَوْ يُحَطُّ عنْه أَلْفُ خَطِيئَةٍ). رواه مسلم"),
    Zikr(
        id: 2,
        content: "الحمد لله",
        description:
            "قال الله تعالى: (وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ). ابراهيم 7.و قال رَسُولَ اللَّهِ ﷺ: (الطُّهُورُ شَطْرُ الإيمانِ، والْحَمْدُ لِلَّهِ تَمْلأُ المِيزانَ). رواه مسلم"),
    Zikr(
        id: 3,
        content: "لا إله إلا الله",
        description:
            "قال رسول الله ﷺ: (فإنَّ اللَّهَ قدْ حَرَّمَ علَى النَّارِ مَن قالَ: لا إلَهَ إلَّا اللَّهُ، يَبْتَغِي بذلكَ وجْهَ اللَّهِ). رواه البخاري"),
    Zikr(
        id: 4,
        content: "الله أكبر",
        description:
            "التكبير جزم وإعلان عن عظمة الله وتعظيم لشعائره. قال الله تعالى: (وَرَبَّكَ فَكَبِّرْ). المدثر 3. و قال: (وَقُلِ اِلْحَمْدُ لِلَّهِ اِلذِي لَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُن لَّهُ شَرِيكٌ فِي اِلْمُلْكِ وَلَمْ يَكُن لَّهُ وَلِيٌّ مِّنَ اَلذُّلِّ. وَكَبِّرْهُ تَكْبِيرًا). الإسراء 111"),
    Zikr(
        id: 5,
        content: "سبحان الله والحمد لله ولا إله إلا الله و الله أكبر",
        description:
            "الأذكار السابقة مجمعة. قال فيهن النبي ﷺ الكثير من الأحاديث. فقال ﷺ : (أَحَبُّ الكَلامِ إلى اللهِ أرْبَعٌ: سُبْحانَ اللهِ، والْحَمْدُ لِلَّهِ، ولا إلَهَ إلَّا اللَّهُ، واللَّهُ أكْبَرُ) رواه مسلم. و قال: ( لَأنْ أقولَ : سُبحانَ اللهِ والحمدُ للهِ ولا إلهَ إلَّا اللهُ واللهُ أكبَرُ أحَبُّ إليَّ ممَّا طلَعَتْ عليه الشَّمسُ). رواه ابن حبان"),
    Zikr(
        id: 6,
        content: "سبحان الله وبحمده",
        description:
            "في حديث أبي هريرة يقول رسول الله ﷺ: (من قال : سبحان اللهِ وبحمدِه مائةَ مرةٍ غُفرَتْ له ذنوبُه وإنْ كانتْ مثلَ زبَدِ البحرِ). رواه الترمذي"),
    Zikr(
        id: 7,
        content: "أستغفر الله",
        description:
            "قال الله عز وجل: (فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا*يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا*وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا). سورة نوح : 10 - 12"),
    Zikr(
        id: 8,
        content: "حسبي الله ونعم الوكيل",
        description:
            "يقول الله تعالى: ( الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُواْ لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَاناً وَقَالُواْ حَسْبُنَا اللّهُ وَنِعْمَ الْوَكِيلُ. فَانقَلَبُواْ بِنِعْمَةٍ مِّنَ اللّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُواْ رِضْوَانَ اللّهِ ).  سورة آل عمران : 173 – 174"),
    Zikr(
        id: 9,
        content: "لا إله إلا أنت سبحانك إني كنت من الظالمين",
        description:
            "قال رسول الله ﷺ:(دعوةُ ذي النُّونِ إذ دعا وهو في بطنِ الحوتِ لا إلهَ إلَّا أنتَ سبحانَك إنِّي كنتُ من الظالمينَ فإنَّه لم يدعُ بها رجلٌ مسلمٌ في شيءٍ قطُّ إلَّا استجاب اللهُ له). رواه الترمذي"),
    Zikr(
        id: 10,
        content: "اللهم صل على سيدنا محمد",
        description:
            "عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللهِ ﷺ قَالَ: (مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى الله عَلَيْهِ عَشْرًا). رواه مسلم"),
    Zikr(
        id: 11,
        content:
            "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير",
        description:
            "في حديث أبي هريرة يقول رسول الله ﷺ:(لا إلَهَ إلَّا اللَّهُ، وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ، وهو علَى كُلِّ شَيءٍ قَدِيرٌ، في يَومٍ مِئَةَ مَرَّةٍ؛ كانَتْ له عَدْلَ عَشْرِ رِقابٍ، وكُتِبَتْ له مِئَةُ حَسَنَةٍ، ومُحِيَتْ عنْه مِئَةُ سَيِّئَةٍ، وكانَتْ له حِرْزًا مِنَ الشَّيْطانِ يَومَهُ ذلكَ حتَّى يُمْسِيَ، ولَمْ يَأْتِ أحَدٌ بأَفْضَلَ ممَّا جاءَ به، إلَّا أحَدٌ عَمِلَ أكْثَرَ مِن ذلكَ). رواه البخاري"),
    Zikr(
        id: 12,
        content: "سبحان الله وبحمده، سبحان الله العظيم",
        description:
            "قال النبي ﷺ: (كَلِمَتانِ خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ، حَبِيبَتانِ إلى الرَّحْمَنِ، سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ). رواه البخاري"),
    Zikr(
        id: 13,
        content: "لا حول ولا قوة إلا بالله",
        description:
            "قال النبي ﷺ لأبي موسى الأشعري: (أَلَا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ؟ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ). مُتَّفَقٌ عَلَيْهِ"),
  ];

  static List<MorningOrNightZikr> morningAzkar = [
    MorningOrNightZikr(
        id: 1,
        content: """
أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]. """,
        count: 1,
        favor: null,
        title: 'آية الكرسى'),
    MorningOrNightZikr(
        id: 2,
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ""",
        count: 3,
        favor: null,
        title: 'سورة الإخلاص'),
    MorningOrNightZikr(
        id: 3,
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ""",
        count: 3,
        title: 'سورة الفلق',
        favor: null),
    MorningOrNightZikr(
        id: 4,
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.""",
        count: 3,
        title: 'سورة الناس',
        favor: null),
    MorningOrNightZikr(
        id: 5,
        content:
            """أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.""",
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 6,
        content:
            """اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 7,
        content:
            """رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 8,
        content:
            """اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.""",
        count: 4,
        favor: null),
    MorningOrNightZikr(
        id: 9,
        content:
            """اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.""",
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 10,
        content: """
حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. """,
        count: 7,
        favor: null),
    MorningOrNightZikr(
        id: 11,
        content:
            """بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.""",
        count: 3,
        favor: "لم يضره من الله شيء."),
    MorningOrNightZikr(
        id: 12,
        content:
            """اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 13,
        content:
            """أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 14,
        content:
            """سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.  """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 15,
        content:
            """اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.  """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 16,
        content:
            """اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 17,
        content:
            """اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.""",
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 18,
        content:
            """يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 19,
        content:
            """أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 20,
        content:
            """اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 21,
        content:
            """أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 22,
        content:
            """اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. """,
        count: 10,
        favor: null),
    MorningOrNightZikr(
        id: 23,
        content:
            """اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 24,
        content:
            """اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.  """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 25,
        content:
            """أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.  """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 26,
        content:
            """يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 27,
        content:
            """اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 28,
        content:
            """اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.  """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 29,
        content:
            """لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. """,
        count: 100,
        favor: null),
    MorningOrNightZikr(
        id: 30,
        content: """سُبْحـانَ اللهِ وَبِحَمْـدِهِ. """,
        count: 100,
        favor: null),
    MorningOrNightZikr(
        id: 31,
        content: """أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ""",
        count: 100,
        favor: null),
  ];

  static List<MorningOrNightZikr> nightAzkar = [
    MorningOrNightZikr(
        id: 1,
        title: 'آية الكرسى',
        content: """أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 2,
        title: 'آخر سورة البقرة',
        content: """أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].""",
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 3,
        title: 'سورة الإخلاص',
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 4,
        title: 'سورة الفلق',
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 5,
        title: 'سورة الناس',
        content: """بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 6,
        content:
            """أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 7,
        content:
            """اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .  """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 8,
        content:
            """رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 9,
        content:
            """اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. """,
        count: 4,
        favor: null),
    MorningOrNightZikr(
        id: 10,
        content:
            """اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 11,
        content:
            """حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.  """,
        count: 7,
        favor: null),
    MorningOrNightZikr(
        id: 12,
        content:
            """بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 13,
        content:
            """اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 14,
        content:
            """أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.  """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 15,
        content:
            """سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 16,
        content:
            """اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 17,
        content:
            """اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 18,
        content:
            """اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 19,
        content: """
يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. 
""",
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 20,
        content:
            """أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 21,
        content:
            """اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 22,
        content:
            """أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 23,
        content:
            """اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. """,
        count: 10,
        favor: null),
    MorningOrNightZikr(
        id: 24,
        content:
            """اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 25,
        content:
            """اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 26,
        content:
            """أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 27,
        content:
            """يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. """,
        count: 3,
        favor: null),
    MorningOrNightZikr(
        id: 28,
        content:
            """لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. """,
        count: 100,
        favor: null),
    MorningOrNightZikr(
        id: 29,
        content:
            """اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. """,
        count: 1,
        favor: null),
    MorningOrNightZikr(
        id: 30,
        content: """سُبْحـانَ اللهِ وَبِحَمْـدِهِ. """,
        count: 100,
        favor: null),
  ];

  static List<Zikr> conditionAzkar = [
    Zikr(
        id: 1,
        title: "لبس ثوب جديد",
        content:
            "اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ كَسَوْتَنِيْهِ أَسْأَلُكَ مِنْ خَيْرِهِ، وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ، وَشَرِّ مَا صُنِعَ لَهُ",
        description:
            "عن أبي سعيد الخدري رضي الله عنه قال: كَانَ رَسُولُ الله- صلى الله عليه وسلم- إذَا اسْتَجَدَّ ثَوباً سَمَّاه بِاسْمِهِ: إمَّا قَمِيصاً أَوْ عِمَامَةً ثُمَّ يَقُولُ: «اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ كَسَوْتَنِيْهِ أَسْأَلُكَ مِنْ خَيْرِهِ، وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ، وَشَرِّ مَا صُنِعَ لَهُ». قَالَ أَبُو نَضْرَةَ: فَكَانَ أَصْحَابُ النَّبِيِّ- صلى الله عليه وسلم- إذَا لَبِسَ أَحَدُهُمْ ثَوباً جَدِيداً قِيلَ لَهُ: تُبْلِي وَيُخْلِفُ الله تَعَالَى. أخرجه أبو داود والترمذي"),
    Zikr(
        id: 2,
        title: "الخروج من البيت",
        content:
            "بسم الله تَوكّلت عَلى الله اللَّهُمَّ إنّا نعُوذُ بِكَ من أَنْ نزِلَّ أَوْ نضِلَّ، أَوْ نظْلِمَ أَوْ نُظْلَمَ، أَوْ نجْهَلَ أَوْ يُجْهَلَ عَلَينا",
        description: """
عن أم سلمة رضي الله عنها أن النَّبِيَّ- صلى الله عليه وسلم- كان إذا خَرج مِنْ بَيْتِه قَالَ: «بسم الله تَوكّلت عَلى الله اللَّهُمَّ إنّا نعُوذُ بِكَ من أَنْ نزِلَّ أَوْ نضِلَّ، أَوْ نظْلِمَ أَوْ نُظْلَمَ، أَوْ نجْهَلَ أَوْ يُجْهَلَ عَلَينا». أخرجه الترمذي والنسائي.
 وعن أنس بن مالك رضي الله عنه أن النبي- صلى الله عليه وسلم- قال: «إذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ فَقَالَ: بِاسْمِ الله، تَوَكَّلْتُ عَلَى الله، لا حَوْلَ وَلا قُوَّةَ إلَّا بِاللهِ» قَالَ: «يُقَالُ حِينَئِذٍ هُدِيتَ وَكُفِيتَ وَوُقِيتَ فَتَتَنَحَّى لَهُ الشَّيَاطِينُ، فَيَقُولُ لَهُ شَيْطَانٌ آخَرُ: كَيفَ لَكَ بِرَجُلٍ قَدْ هُدِيَ وَكُفِيَ وَوُقِيَ». أخرجه أبو داود والترمذي
"""),
    Zikr(
        id: 3,
        title: "دخول دورة المياة",
        content: "اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الخُبْثِ وَالخَبَائِثِ",
        description: """
عن أنس رضي الله عنه قال: كان النبي- صلى الله عليه وسلم- إذا دخل الخلاء قال: «اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الخُبْثِ وَالخَبَائِثِ». متفق عليه"""),
    Zikr(
        id: 4,
        title: "الخروج من دورة المياة",
        content: "غُفْرَانَكَ",
        description: """
عن عائشة رضي الله عنها أَنَّ النَّبِيَّ- صلى الله عليه وسلم- كَانَ إذَا خَرَجَ مِنَ الغَائِطِ قَالَ: «غُفْرَانَكَ». أخرجه أبو داود والترمذي
"""),
    Zikr(
        id: 5,
        title: "دخول المسجد",
        content: "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        description:
            """ إذا دخلَ أحدُكُمُ المسجِدَ ، فليسلِّم علَى النَّبيِّ صلَّى اللَّهُ عليهِ وسلَّمَ ، ثمَّ ليقُلْ : اللَّهمَّ افتَح لي أبوابَ رحمتِكَ ، وإذا خرجَ فليقُلْ : اللَّهمَّ إنِّي أسألُكَ مِن فضلِكَ. أخرجه ابن ماجه واللفظ له، وأخرجه مسلم باختلاف يسير"""),
    Zikr(
        id: 6,
        title: "الخروج من المسجد",
        content: "اللَّهُمَّ إنِّي أسْأَلُكَ مِن فَضْلِكَ",
        description: """
إذا دَخَلَ أحَدُكُمُ المَسْجِدَ، فَلْيَقُلِ: اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِكَ، وإذا خَرَجَ، فَلْيَقُلِ: اللَّهُمَّ إنِّي أسْأَلُكَ مِن فَضْلِكَ.
الراوي : أبو حميد أو أبو أسيد الساعدي.حديث صحيح رواه مسلم 
"""),
    Zikr(
        id: 7,
        title: "1 سماع الأذان",
        content: "قل كما يقول المؤذن. ثم صل على النبي",
        description: """
عن عبد الله بن عمرو بن العاص رضي الله عنهما أنه سمع النبي- صلى الله عليه وسلم- يقول: «إذَا سَمِعْتُمُ المُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ، ثُمَّ صَلُّوا عَلَيَّ؛ فَإنَّهُ مَنْ صَلَّى عَلَيَّ صَلاةً صَلَّى الله عَلَيهِ بِهَا عَشْراً، ثُمَّ سَلُوا الله لِيَ الوَسِيلَةَ فَإنَّهَا مَنْزِلَةٌ فِي الجَنَّةِ لا تَنْبَغِي إلَّا لِعَبْدٍ مِنْ عِبَادِ الله، وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ، فَمَنْ سَأَلَ لِيَ الوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ». أخرجه مسلم."""),
    Zikr(
        id: 8,
        title: "2 سماع الأذان",
        content:
            "أَشْهَدُ أَنْ لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِالله رَبّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالإسْلامِ دِيناً",
        description: """
عن سعد بن أبي وقاص رضي الله عنه عن رسول الله- صلى الله عليه وسلم- أَنَّهُ قَالَ: «مَنْ قَالَ حِينَ يَسْمَعُ المُؤَذِّنَ: أَشْهَدُ أَنْ لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِالله رَبّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالإسْلامِ دِيناً، غُفِرَ لَهُ ذَنْبُهُ». أخرجه مسلم
"""),
    Zikr(
        id: 9,
        title: "بعد سماع الأذان",
        content:
            "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاةِ القَائِمَةِ، آتِ مُحَمَّداً الوَسِيلَةَ وَالفَضِيلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ",
        description: """
عن جابر بن عبد الله رضي الله عنهما أن رسول الله- صلى الله عليه وسلم- قال: «مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ: اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاةِ القَائِمَةِ، آتِ مُحَمَّداً الوَسِيلَةَ وَالفَضِيلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ، حَلَّتْ لَهُ شَفَاعَتِي يَومَ القِيَامَةِ». أخرجه البخاري."""),
    Zikr(
        id: 10,
        title: "عند الكرب",
        content:
            "لا إلَهَ إلَّا الله العَظِيمُ الحَلِيمُ، لا إلَهَ إلَّا الله رَبُّ العَرْشِ العَظِيمِ، لا إلَهَ إلَّا الله رَبُّ السَّماَوَاتِ، وَرَبُّ الأَرْضِ، وَرَبُّ العَرْشِ الكَريمِ",
        description: """
عن ابن عباس رضي الله عنهما أَنَّ رَسُولَ الله- صلى الله عليه وسلم- كَانَ يَقُولُ عِنْدَ الكَرْبِ: «لا إلَهَ إلَّا الله العَظِيمُ الحَلِيمُ، لا إلَهَ إلَّا الله رَبُّ العَرْشِ العَظِيمِ، لا إلَهَ إلَّا الله رَبُّ السَّماَوَاتِ، وَرَبُّ الأَرْضِ، وَرَبُّ العَرْشِ الكَريمِ». متفق عليه."""),
    Zikr(
        id: 11,
        title: "عند الهَمّ أو الحزن",
        content:
            "اللَّهُمَّ إنِّي عَبْدُكَ، وَابْنُ عَبْدِكَ، وَابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ عَلَّمْتَهُ أَحَداً مِن خَلْقِكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجِلاءَ حُزْنِي وَذَهَابَ هَمِّي",
        description: """
عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله- صلى الله عليه وسلم-: «مَا أَصَابَ أَحَداً قَطُّ هَمٌّ وَلا حُزْنٌ فَقَالَ: اللَّهُمَّ إنِّي عَبْدُكَ، وَابْنُ عَبْدِكَ، وَابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ عَلَّمْتَهُ أَحَداً مِن خَلْقِكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجِلاءَ حُزْنِي وَذَهَابَ هَمِّي، إلَّا أَذْهَبَ الله هَمَّهُ وَحُزْنَهُ وَأَبْدَلَهُ مَكَانَهُ فَرَحَاً» قَالَ: فَقِيلَ: يَا رَسُولَ الله ألا نَتَعَلَّمُهَا فَقَالَ: «بَلَى يَنْبَغِي لِمَنْ سَمِعَهَا أَنْ يَتَعَلَّمَهَا». أخرجه أحمد.
"""),
    Zikr(
        id: 12,
        title: "عند الخوف من قوم",
        content:
            "اللَّهُمَّ إنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
        description: """
أنَّ النبيَّ صلَّى اللهُ عليهِ وسلَّمَ كان إذا خاف قومًا قال : اللهمَّ إنَّا نجعلُكَ في نحورهم ، ونعوذُ بكَ من شرورهم.الراوي أبو موسى الأشعري أخرجه أبو داود واللفظ له، وأحمد باختلاف يسيرو إسناده صحيح"""),
    Zikr(
        id: 13,
        title: "عند لقاء العدو",
        content: "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
        description: """
وعن ابن عباس رضي الله عنهما: {حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ} قَالَهَا إبرَاهِيمُ عَلَيهِ السَّلامُ حِينَ أُلْقِيَ فِي النَّارِ، وَقَالَهَا مُحَمَّدٌ- صلى الله عليه وسلم- حِينَ قَالُوا: {إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ}.
أخرجه البخاري.
"""),
    Zikr(
        id: 14,
        title: "إذا غلبك أمر",
        content: "قَدَرُ الله وَمَا شَاءَ فَعَلَ",
        description: """
عن أبي هريرة رضي الله عنه قال: قال رسول الله- صلى الله عليه وسلم-: «المُؤْمِنُ القَوِيُّ خَيرٌ وَأَحَبُّ إلَى الله مِنَ المُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ، احْرِصْ عَلَى مَا يَنْفَعُكَ، وَاسْتَعِنْ بِالله وَلا تَعْجَزْ، وَإنْ أَصَابَكَ شَيْءٌ فَلا تَقُلْ: لَو أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ: قَدَرُ الله وَمَا شَاءَ فَعَلَ، فَإنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ». أخرجه مسلم"""),
    Zikr(
        id: 15,
        title: "عند فعل ذنب",
        content:
            "فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَينِ، ثُمَّ يَسْتَغْفِرُ الله",
        description: """
عن أبي بكر رضي الله عنه قال: سمعت رسول الله- صلى الله عليه وسلم- يقول: «مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَينِ، ثُمَّ يَسْتَغْفِرُ الله إلَّا غَفَرَ الله لَهُ»، ثم قرأ هذه الآية: {وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ} إلى آخر الآية. أخرجه أبو داود والترمذي
"""),
    Zikr(
        id: 16,
        title: "من عليه دين عجز عنه",
        content:
            "اللَّهُمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ، وَأَغَنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
        description: """
عن علي رضي الله عنه أَنَّ مُكَاتَباً جَاءَهُ فَقَالَ: إنِّي قَدْ عَجَزْتُ عَنْ كِتَابَتِي فَأَعِنِّي قَالَ: أَلا أُعَلِّمُكَ كَلِمَاتٍ عَلَّمَنِيهِنَّ رَسُولُ الله- صلى الله عليه وسلم- لَوْ كَانَ عَلَيْكَ مِثْلُ جَبَلِ ثَبِيرٍ دَيْناً أَدَّاهُ الله عَنْكَ؟ قال: قُلْ: «اللَّهُمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ، وَأَغَنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ». أخرجه الترمذي"""),
    Zikr(
        id: 17,
        title: "عند الغضب",
        content: "أَعُوذُ بِالله مِنَ الشَّيْطَانِ الرَّجِيمِ",
        description: """
عن سليمان بن صُرَد رضي الله عنه قال: اسْتَبَّ رَجُلانِ عِنْدَ النَّبِيِّ- صلى الله عليه وسلم- وَنَحْنُ عِنْدَهُ جُلُوسٌ وَأَحَدُهُمَا يَسُبُّ صَاحِبَهُ مُغْضَباً قَدِ احْمَرَّ وَجْهُهُ فَقَالَ النَّبِيُّ- صلى الله عليه وسلم-: «إنِّي لأَعْلَمُ كَلِمَةً لَو قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ، لَو قَالَ: أَعُوذُ بِالله مِنَ الشَّيْطَانِ الرَّجِيمِ..». رواه البخاري.

"""),
    Zikr(
        id: 18,
        title: "عند القيام من المجلس",
        content:
            "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إلَهَ إلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إلَيْكَ",
        description: """
عن أبي هريرة رضي الله عنه قال: قال رسول الله- صلى الله عليه وسلم-: «مَنْ جَلَسَ فِي مَجْلِسٍ فَكَثُرَ فِيهِ لَغَطُهُ فَقَالَ قَبْلَ أَنْ يَقُومَ مِنْ مَجْلِسِهِ ذَلِكَ: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إلَهَ إلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إلَيْكَ، إلَّا غُفِرَ لَهُ مَا كَانَ فِي مَجْلِسِهِ ذَلِكَ». أخرجه أحمد والترمذي
"""),
    Zikr(
        id: 19,
        title: "إذا رأى مبتلى بمرض أو غيره",
        content:
            "الحمدُ للهِ الذي عافاني مما ابتلاكَ به ، و فضَّلني على كثيرٍ ممن خلق تفضيلًا",
        description: """
عن ابن عمر رضي الله عنهما قال: قال رسول الله- صلى الله عليه وسلم-: «مَنْ رَأَى مُبْتَلَىً فَقَالَ: الحَمْدُ للهِ الَّذِي عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً لَمْ يُصِبْهُ ذَلِكَ البَلاءُ». أخرجه الطبراني في الأوسط.
"""),
    Zikr(
        id: 20,
        title: "عند النوم",
        content:
            "باسمِكَ ربي وضعْتُ جنبي وبكَ أرْفَعُهُ فإِنْ أمسَكْتَ نفسي فارحمْها وإِنْ أرسلْتَها فاحفظْها بِما تحفَظُ بِهِ عبادَكَ الصالِحينَ",
        description: """
إذا أوَى أحَدُكُمْ إلى فِراشِهِ، فَلْيَنْفُضْ فِراشَهُ بداخِلَةِ إزارِهِ؛ فإنَّه لا يَدْرِي ما خَلَفَهُ عليه، ثُمَّ يقولُ: باسْمِكَ رَبِّ، وضَعْتُ جَنْبِي، وبِكَ أرْفَعُهُ، إنْ أمْسَكْتَ نَفْسِي فارْحَمْها، وإنْ أرْسَلْتَها فاحْفَظْها بما تَحْفَظُ به عِبادَكَ الصَّالِحِينَ.
الراوي : أبو هريرة و المحدث : البخاري"""),
    Zikr(
        id: 21,
        title: "عند الاستيقاظ",
        content:
            "الحَمْدُ لِلَّهِ الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ",
        description:
            """كانَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أرَادَ أنْ يَنَامَ قالَ: باسْمِكَ اللَّهُمَّ أمُوتُ وأَحْيَا، وإذَا اسْتَيْقَظَ مِن مَنَامِهِ قالَ: الحَمْدُ لِلَّهِ الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ.
الراوي : حذيفة بن اليمان و المحدث : البخاري"""),
    Zikr(
        id: 22,
        title: "عند رؤية ما يعجبك",
        content: "ما شاء الله أو اللهم بارك فيه",
        description: """
وَلَوْلا إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَاءَ اللَّهُ لا قُوَّةَ إِلَّا بِاللَّهِ[الكهف:39] .وفي الحديث: إذا رأى أحدُكم ما يُعجبُهُ في نَفسِهِ ، أو مالِهِ فليبرِّكْ علَيهِ فإنَّ العَينَ حقٌّ """),
  ];
  static const shareMessage =
      'https://play.google.com/store/apps/details?id=com.neutron.bank_el_zikr';

  static List<Prayer> prayers = [
    Prayer(id: 0, content: "اللهم إنك عفو كريم تحب العفو، فاعفُ عني"),
    Prayer(
        id: 1,
        content:
            "اللهم ربنا لك الحمد أنت قيّم السماوات والأرض، ولك الحمد أنت رب السماوات والأرض ومن فيهن، ولك الحمد أنت نور السماوات والأرض ومن فيهن، أنت الحق، وقولك الحق، ووعدك الحق، ولقاؤك الحق، والجنة حق، والنار حق، والساعة حق، اللهم: لك أسلمت، وبك آمنت، وعليك توكلت، وإليك خاصمت، وبك حاكمت، فاغفر لي: ما قدمت، وما أخرت، وأسررت، وأعلنت، وما أنت أعلم به مني، لا إله إلا أنت"),
    Prayer(
        id: 2,
        content:
            "اللهم إني أعوذ بك من العجز والكسل والجبن والهرم والبخل، وأعوذ بك من عذاب القبر، ومن فتنة المحيا والممات"),
    Prayer(
        id: 3,
        content:
            "اللهم إني أعوذ بك من فتنة النار، وعذاب النار، وفتنة القبر، وعذاب القبر، ومن شر فتنة الغنى، ومن شر فتنة الفقر، وأعوذ بك من شر فتنة المسيح الدجال، اللهم اغسل خطاياي بماء الثلج والبرد، ونقِّ قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم إني أعوذ بك من الكسل والهرم والمأثم والمغرم"),
    Prayer(
        id: 4,
        content:
            " أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك أنت كما أثنيت على نفسك"),
    Prayer(
        id: 5,
        content:
            "اللهم إني أعوذ بك من علم لا ينفع، وقلب لا يخشع، ودعاء لا يُسمع، ونفس لا تشبع"),
    Prayer(
        id: 6,
        content:
            "اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله لا إله إلا أنت"),
    Prayer(
        id: 7,
        content: "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار"),
    Prayer(
        id: 8,
        content:
            "اللهم إني أسألك من الخير كله عاجله وآجله ما علمتُ منه وما لم أعلم، وأعوذ بك من الشر كله عاجله وآجله ما علمتُ منه وما لم أعلم، اللهم إني أسألك من خير ما سألك عبدك ونبيك، وأعوذ بك من شر ما عاذ به عبدك ونبيك، اللهم إني أسألك الجنة وما قرب إليها من قول أو عمل، وأعوذ بك من النار وما قرب إليها من قول أو عمل، وأسألك أن تجعل كل قضاء قضيته لي خيرا"),
    Prayer(
        id: 9,
        content:
            "اللهم بعلمك الغيب، وقدرتك على الخلق أحيني ما علمتَ الحياة خيراً لي، وتوفني إذا علمت الوفاة خيراً لي، اللهم وأسألك خشيتك في الغيب والشهادة، وأسألك كلمة الحق في الرضا والغضب، وأسألك القصد في الفقر والغنى، وأسألك نعيماً لا ينفد، وأسألك قرة عين لا تنقطع، وأسألك الرضاء بعد القضاء، وأسألك بَرْد العيش بعد الموت، وأسألك لذة النظر إلى وجهك والشوق إلى لقائك في غير ضراء مضرة، ولا فتنة مضلة، اللهم زينا بزينة الإيمان، واجعلنا هداة مهتدين"),
    Prayer(
        id: 10,
        content:
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ"),
    Prayer(
        id: 11,
        content:
            "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء لك بذنبي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت"),
    Prayer(
        id: 12,
        content:
            " {رَبَّنَا ءاتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ}[البقرة: 201]"),
    Prayer(
        id: 13,
        content:
            "{رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنْ الْخَاسِرِينَ}[الأعراف: 23]"),
    Prayer(
        id: 14,
        content:
            " {رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}[البقرة: 286]"),
    Prayer(
        id: 15,
        content:
            "{رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا}[الفرقان: 74] "),
    Prayer(
        id: 16,
        content:
            "{رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِي مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ}[نوح: 28] "),
    Prayer(
        id: 17,
        content:
            " {رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ}[القصص: 24]"),
    Prayer(
        id: 18,
        content:
            "{رَبَّنَا ءاتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا}[الكهف: 10] "),
    Prayer(
        id: 19,
        content:
            "{رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ}[المؤمنون: 97-98] "),
    Prayer(
        id: 20,
        content:
            "{رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ}[التحريم: 8] "),
    Prayer(
        id: 21,
        content:
            "{رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ}[آل عمران: 16] "),
    Prayer(
        id: 22,
        content:
            "{رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ}[آل عمران: 38] "),
    Prayer(
        id: 23,
        content:
            "اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك وارحمني، إنك أنت الغفور الرحيم"),
    Prayer(
        id: 24,
        content:
            "{رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ}[النمل: 19]"),
    Prayer(
        id: 25,
        content:
            "اللهم صل على محمد وعلى آل محمد، كما صليت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد"),
    Prayer(
        id: 26,
        content:
            "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والجبن والبخل، وضلع الدين، وغلبة الرجال"),
    Prayer(
        id: 27,
        content:
            "اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك وفجاءة نقمتك، وجميع سخطك"),
    Prayer(
        id: 28,
        content: "اللهم إني أعوذ بك من البرص والجنون والجذام ومن سيئ الأسقام"),
    Prayer(
        id: 29,
        content: "اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء"),
    Prayer(
        id: 30,
        content:
            "اللهم إني أعوذ بك من الهدم وأعوذ بك من التردي وأعوذ بك من الغرق والحرق والهرم وأعوذ بك أن يتخبطني الشيطان عند الموت وأعوذ بك أن أموت في سبيلك مدبرا وأعوذ بك أن أموت لديغا"),
    Prayer(
        id: 31,
        content:
            "اللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم"),
    Prayer(id: 32, content: "اللهم إني أسألك الهدى والتقى والعفاف والغنى"),
    Prayer(id: 33, content: "اللهم أعني على ذكرك وشكرك وحسن عبادتك"),
    Prayer(
        id: 34,
        content:
            "اللهم اغفر لي خطيئتي، وجهلي وإسرافي، في أمري وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكل ذلك عندي، اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر، وأنت على كل شيء قدير"),
    Prayer(
        id: 35,
        content:
            "اللهم حبب إلينا الإيمان وزينه في قلوبنا، وكره إلينا الكفر والفسوق والعصيان، واجعلنا من الراشدين، اللهم توفنا مسلمين وأحينا مسلمين وألحقنا بالصالحين غير خزايا ولا مفتونين"),
    Prayer(
        id: 36,
        content:
            "اللهم اغفر لي ذنبي كله، دقه وجله، وأوله وآخره، وعلانيته وسره"),
    Prayer(
        id: 37,
        content:
            "اللهم ربنا آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار"),
    Prayer(id: 38, content: "يا مقلب القلوب ثبت قلبي على دينك"),
    Prayer(id: 39, content: "اللهم أحسنت خَلقي فأحسن خُلقي"),
    Prayer(
        id: 40,
        content:
            "اللهم أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك، أنت كما أثنيت على نفسك"),
    Prayer(
        id: 41,
        content:
            "اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت، وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، لا إله إلا أنت"),
    Prayer(
        id: 42,
        content:
            "اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت وقني شر ما قضيت، إنك تقضي ولا يقضى عليك، وإنه لا يذل من واليت ولا يعز من عاديت تباركت ربنا وتعاليت"),
  ];
}
